"""Программа - это набор инструкций,
написанных на языке программирования,
который компьютер может понять и выполнить.
Когда вы создаете программу,
вы даете компьютеру указания о том, как решать определенную задачу."""
print('Hello, world!')
"""Алгоритм - это последовательность шагов для выполнения конкретной задачи.
Алгоритм не привязан к конкретному языку программирования и может быть описан в общих терминах."""
num1 = int(input('Введите 1 число: '))
num2 = int(input('Введите 2 число: '))
if num1 > num2:
    print(num1)
else:
    print(num2)
